
### :robot: Terraform Report
---
##### Plan: `13` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_member.python_nb_sa_project_access["roles/datastore.user"] will be created
  + resource "google_project_iam_member" "python_nb_sa_project_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "maestro-intelligence"
      + role    = "roles/datastore.user"
    }

  # google_project_iam_member.python_nb_sa_project_access["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "python_nb_sa_project_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "maestro-intelligence"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_iam_member.python_nb_sa_project_access["roles/storage.objectUser"] will be created
  + resource "google_project_iam_member" "python_nb_sa_project_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "maestro-intelligence"
      + role    = "roles/storage.objectUser"
    }

  # google_project_iam_member.python_nb_sa_project_access["roles/storage.objectViewer"] will be created
  + resource "google_project_iam_member" "python_nb_sa_project_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "maestro-intelligence"
      + role    = "roles/storage.objectViewer"
    }

  # google_service_account.python_nb_sa will be created
  + resource "google_service_account" "python_nb_sa" {
      + account_id   = "python-nb-sa"
      + disabled     = false
      + display_name = "Service Account for python notebooks"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "maestro-intelligence"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.backend_admin["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_member" "backend_admin" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = "projects/maestro-intelligence/serviceAccounts/maestro-backend@maestro-intelligence.iam.gserviceaccount.com"
    }

  # google_service_account_iam_member.backend_admin["roles/iam.serviceAccountUser"] will be created
  + resource "google_service_account_iam_member" "backend_admin" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = "projects/maestro-intelligence/serviceAccounts/maestro-backend@maestro-intelligence.iam.gserviceaccount.com"
    }

  # google_service_account_iam_member.python_nb_sa_self["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_member" "python_nb_sa_self" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.python_nb_sa_self["roles/iam.serviceAccountUser"] will be created
  + resource "google_service_account_iam_member" "python_nb_sa_self" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_storage_bucket.python_nb_bucket will be created
  + resource "google_storage_bucket" "python_nb_bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "python_nb_bucket"
      + project                     = "maestro-intelligence"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket_iam_member.python_nb_sa_access["roles/storage.admin"] will be created
  + resource "google_storage_bucket_iam_member" "python_nb_sa_access" {
      + bucket = "maestro_backend_overlays"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.admin"
    }

  # google_storage_bucket_iam_member.python_nb_sa_access["roles/storage.objectUser"] will be created
  + resource "google_storage_bucket_iam_member" "python_nb_sa_access" {
      + bucket = "maestro_backend_overlays"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectUser"
    }

  # google_storage_bucket_iam_member.python_nb_sa_access["roles/storage.objectViewer"] will be created
  + resource "google_storage_bucket_iam_member" "python_nb_sa_access" {
      + bucket = "maestro_backend_overlays"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectViewer"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#12185783840`](https://github.com/lessthan3/personalization/actions/runs/12185783840) - commit 815f31e64cebbbb14e4912825cc681889592ac0d
